Расширение/Расширение/Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияТоваровУслуг</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетШтрихКодов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыБухгалтерии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГозКонтракт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КонтрактыГОЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗаписыватьСебестИТовОрг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружатьВБП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьСерийныхНомеровИзПула</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектРазвития</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектыРазвития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураСканирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГОЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьиРасходовГоз</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Расширение/Расширение/InformationRegisters/СерийныеНомераНаПечать.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СерийныеНомераНаПечать</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Распечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДобавленныйСерийныйНомер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.B1_СканированиеНомеровНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.B1_ГенерацияСерийныхНомеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Расширение/Расширение/Documents/B1_СканированиеНомеровНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>B1_СканированиеНомеровНаСклад</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетШтрихКодов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПечататьЭтикетку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СерийныйНомера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Не используется. Нужен для работы расширения ДатаМобайл</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Расширение/Расширение/Catalogs/ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПредопределенныеЗначения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Значения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение4</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Расширение/Расширение/Documents/РеализацияТоваровУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура Buro1Goz_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	СтраницаГВ_ГОЗ  = Элементы.Добавить("ГОЗ", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы);
	СтраницаГВ_ГОЗ.Заголовок = НСтр("ru = 'Контракты ГОЗ'");
	СтраницаГВ_ГОЗ.Вид = ВидГруппыФормы.Страница;
	
	ПолеДляДокГОЗ = Элементы.Добавить("B1_КонтрактыГОЗ", Тип("ПолеФормы"), СтраницаГВ_ГОЗ);
	ПолеДляДокГОЗ.Вид = ВидПоляФормы.ПолеВвода;                            
	ПолеДляДокГОЗ.Заголовок = "Контракт ГОЗ(документ)";
	ПолеДляДокГОЗ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеДляДокГОЗ.ПутьКДанным = "Объект.ГозКонтракт";
	
	ПолеДляСебестИТовОрг = Элементы.Добавить("В1_СебестИТовОрг", Тип("ПолеФормы"), СтраницаГВ_ГОЗ);
	ПолеДляСебестИТовОрг.Вид = ВидПоляФормы.ПолеПереключателя;
	ПолеДляСебестИТовОрг.Заголовок = "Не записывать движения по себестоимости и товарам организаций";
	ПолеДляСебестИТовОрг.ПутьКДанным = "Объект.НеЗаписыватьСебестИТовОрг";
	
	ПолеДляСебестИТовОрг = Элементы.Добавить("ПечатьСерийныхНомеровИзПула", Тип("ПолеФормы"), СтраницаГВ_ГОЗ);
	ПолеДляСебестИТовОрг.Вид = ВидПоляФормы.ПолеПереключателя;
	ПолеДляСебестИТовОрг.ПутьКДанным = "Объект.ПечатьСерийныхНомеровИзПула";
	
	ПолеДляСебестИТовОрг = Элементы.Добавить("НеВыгружатьВБП", Тип("ПолеФормы"), СтраницаГВ_ГОЗ);
	ПолеДляСебестИТовОрг.Вид = ВидПоляФормы.ПолеПереключателя;
	ПолеДляСебестИТовОрг.ПутьКДанным = "Объект.НеВыгружатьВБП";
	
	ТЧРасходыГОЗ = Элементы.Добавить("B1_ТЧ_ГОЗ", Тип("ТаблицаФормы"), СтраницаГВ_ГОЗ);
	ТЧРасходыГОЗ.ПутьКДанным = "Объект.ГОЗ";
	ТЧРасходыГОЗ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;    
	
	Об = РеквизитФормыВЗначение("Объект");
	ТабЧасти = Об.Метаданные().ТабличныеЧасти;	
	Для каждого КолонкаОбъекта Из ТабЧасти.ГОЗ.СтандартныеРеквизиты Цикл
		
		ИмяКолонки = "B1_ТЧ_ГОЗ" + КолонкаОбъекта.Имя;
		
		ЭлементыТаблицыФормы = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ТЧРасходыГОЗ);
		ЭлементыТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементыТаблицыФормы.ПутьКДанным = "Объект.ГОЗ." + КолонкаОбъекта.Имя;	
	
	КонецЦикла;
	
	Для каждого КолонкаОбъекта Из ТабЧасти.ГОЗ.Реквизиты Цикл
		
		ИмяКолонки = "B1_ТЧ_ГОЗ" + КолонкаОбъекта.Имя;
		
		ЭлементыТаблицыФормы = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ТЧРасходыГОЗ);
		ЭлементыТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементыТаблицыФормы.ПутьКДанным = "Объект.ГОЗ." + КолонкаОбъекта.Имя;	
	
	КонецЦикла;
	
	ПолеПроектРазвития = Элементы.Добавить("ПроектРазвития", Тип("ПолеФормы"), Элементы.ГруппаПараметрыПраво);
	ПолеПроектРазвития.Вид = ВидПоляФормы.ПолеВвода;                            
	ПолеПроектРазвития.ПутьКДанным = "Объект.ПроектРазвития";
	
	ПолеДляДокГОЗ = Элементы.Добавить("НоменклатураСканирования", Тип("ПолеФормы"), Элементы.Группа3);
	ПолеДляДокГОЗ.Вид = ВидПоляФормы.ПолеВвода;                            
	ПолеДляДокГОЗ.Заголовок = "Номенклатура сканирования";
	ПолеДляДокГОЗ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеДляДокГОЗ.ПутьКДанным = "Объект.НоменклатураСканирования";
	ПолеДляДокГОЗ.КнопкаВыбора = Ложь;
	ПолеДляДокГОЗ.РежимВыбораИзСписка = Истина;
	ПолеДляДокГОЗ.Ширина = 20;
	ПолеДляДокГОЗ.РастягиватьПоГоризонтали = Ложь;
	ПолеДляДокГОЗ.УстановитьДействие(
		"НачалоВыбора", 		   
		"НачалоВыбораНоменклатураСканирования");
	Элементы.Переместить(ПолеДляДокГОЗ, Элементы.Группа3, Элементы.ДобавляемыйСерийныйНомер);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		ПолеДляДокГОЗ.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокВыбораНаСервере());	
	
	КонецЕсли;
	
	Buro1Goz_ОбновитьДанныеПослеНаСервере(); 
	
	НайденноеЗначение = Справочники.ПредопределенныеЗначения.ПолучитьПредопределенноеЗначение("УдалитьНомераВРеализации", Ложь);
	Если ЗначениеЗаполнено(НайденноеЗначение) Тогда
		
		НайденныеСтроки = НайденноеЗначение.Значения.НайтиСтроки(Новый Структура("Значение", ПараметрыСеанса.Текущийпользователь.Наименование));
		
		Элементы.УдалитьНомера.Видимость = НайденныеСтроки.Количество();
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораНоменклатураСканирования(Элемент)
	
	МассивВыбора = ПолучитьСписокВыбораНаСервере();
	Элемент.СписокВыбора.ЗагрузитьЗначения(МассивВыбора);
	Если МассивВыбора.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В табличной части отсутствуют товары, либо не настроен макет для сканируемой номенклатуры!";
		Сообщение.Сообщить();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораНаСервере()

	СписокВыбора = Новый СписокЗначений;
	
	ЗапросНоменклатурыСканирования = Новый Запрос("
			|ВЫБРАТЬ
			|	НастройкаСобственныхСерийныхНомеров.Номенклатура КАК Номенклатура,
			|	НастройкаСобственныхСерийныхНомеров.ИмяМакета КАК ИмяМакета
			|ИЗ
			|	РегистрСведений.НастройкаСобственныхСерийныхНомеров КАК НастройкаСобственныхСерийныхНомеров
			|ГДЕ
			|	НастройкаСобственныхСерийныхНомеров.Номенклатура В (&Номенклатура)");
	
	ЗапросНоменклатурыСканирования.УстановитьПараметр("Номенклатура", Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	Возврат ЗапросНоменклатурыСканирования.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");

КонецФункции

&НаСервере
Процедура Buro1Goz_ОбновитьДанныеПослеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерийныеНомераНаПечатьСрезПоследних.СерийныйНомер КАК СерийныйНомер,
	|	1 КАК Количество
	|ИЗ
	|	РегистрСведений.СерийныеНомераНаПечать.СрезПоследних(, ) КАК СерийныеНомераНаПечатьСрезПоследних
	|ГДЕ
	|	СерийныеНомераНаПечатьСрезПоследних.Реализация = &Реализация";
	Запрос.УстановитьПараметр("Реализация", Объект.Ссылка);
	СерийныеНомера.Загрузить(Запрос.Выполнить().Выгрузить());
	ВсегоСерийныхНомеров = СерийныеНомера.Количество();
	
	Элементы.СтраницаСерийныеНомера.Заголовок = СтрШаблон("Серийные номера (%1)", СтрЗаменить(ВсегоСерийныхНомеров, Символы.НПП, ""));
	
КонецПроцедуры

&НаКлиенте
Процедура Buro1Goz_ОбновитьДанныеПосле(Команда)
	Buro1Goz_ОбновитьДанныеПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Buro1Goz_ДобавитьСерийныйНомерПосле(Команда)
	Buro1Goz_ДобавитьСерийныйНомерПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура Buro1Goz_ДобавитьСерийныйНомерПослеНаСервере() 
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		Сообщить("Предварительно необходимо записать документ!");
		Возврат;	
	
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура("СерийныйНомер", ДобавляемыйСерийныйНомер);
	НайденнаяСтрока = СерийныеНомера.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденнаяСтрока.Количество() = 0 Тогда 
		
		Если ЗначениеЗаполнено(ДобавляемыйСерийныйНомер) Тогда
			
			ИмяМакета = "";
			
			ЗапросНоменклатурыСканирования = Новый Запрос("
				|ВЫБРАТЬ
				|	НастройкаСобственныхСерийныхНомеров.Номенклатура КАК Номенклатура,
				|	НастройкаСобственныхСерийныхНомеров.ИмяМакета КАК ИмяМакета
				|ИЗ
				|	РегистрСведений.НастройкаСобственныхСерийныхНомеров КАК НастройкаСобственныхСерийныхНомеров
				|ГДЕ
				|	НастройкаСобственныхСерийныхНомеров.Номенклатура В (&Номенклатура)");
			
			Если НЕ ЗначениеЗаполнено(Объект.НоменклатураСканирования) Тогда
							
				ЗапросНоменклатурыСканирования.УстановитьПараметр("Номенклатура", Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
				РезультатНоменклатурыСканирования = ЗапросНоменклатурыСканирования.Выполнить().Выгрузить();
				Если РезультатНоменклатурыСканирования.Количество() = 1 Тогда
					
					ИмяМакета = РезультатНоменклатурыСканирования[0].ИмяМакета;
					
				Иначе
					
					Сообщить("Не указана номенклатуры сканирования");
					Возврат;	
					
				КонецЕсли;	
				
			Иначе
				
				МассивНом = Новый Массив;
				МассивНом.Добавить(Объект.НоменклатураСканирования);
				
				ЗапросНоменклатурыСканирования.УстановитьПараметр("Номенклатура", МассивНом);
				РезультатНоменклатурыСканирования = ЗапросНоменклатурыСканирования.Выполнить().Выгрузить();
				Если РезультатНоменклатурыСканирования.Количество() = 1 Тогда
					
					ИмяМакета = РезультатНоменклатурыСканирования[0].ИмяМакета; 
					
				Иначе	
					
					Сообщить("Не найдена настройка для номенклатуры сканирования: " + Объект.НоменклатураСканирования);
					Возврат;
					
				КонецЕсли;	
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ИмяМакета) Тогда
			
				Сообщить("Не установлено имя макета!");
				Возврат;	
			
			КонецЕсли;	
			
			
			МенеджерЗаписи = РегистрыСведений.СерийныеНомераНаПечать.СоздатьМенеджерЗаписи(); 
			
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.Реализация = Объект.Ссылка;
			МенеджерЗаписи.СерийныйНомер = ДобавляемыйСерийныйНомер;
			МенеджерЗаписи.ИмяМакета = ИмяМакета;
			МенеджерЗаписи.ДобавленныйСерийныйНомер = Истина; 
			МенеджерЗаписи.Записать();
			
			Buro1Goz_ОбновитьДанныеПослеНаСервере();
			
		Иначе
			
			Сообщить("Поле серийный номер не заполнено!");
			
		КонецЕсли;		
		
	Иначе 
		
		Сообщить("Данный серийный номер уже добавлен.");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Buro1Goz_СгенерироватьСерийныеНомераВместо(Команда)
	Buro1Goz_СгенерироватьСерийныеНомераНаСервереВместо();
КонецПроцедуры

&НаСервере
Процедура Buro1Goz_СгенерироватьСерийныеНомераНаСервереВместо()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		Сообщить("Предварительно необходимо записать документ!");
		Возврат;	
	
	КонецЕсли;
	
	ИмяМакета = "";
	
	ЗапросНоменклатурыСканирования = Новый Запрос("
	|ВЫБРАТЬ
	|   НастройкаСобственныхСерийныхНомеров.Префикс КАК Префикс,
	|   НастройкаСобственныхСерийныхНомеров.ОбщаяДлинаКода КАК ОбщаяДлинаКода,
	|   НастройкаСобственныхСерийныхНомеров.ПоследнийНомер КАК ПоследнийНомер,
	|	НастройкаСобственныхСерийныхНомеров.Номенклатура КАК Номенклатура,
	|	НастройкаСобственныхСерийныхНомеров.ИмяМакета КАК ИмяМакета
	|ИЗ
	|	РегистрСведений.НастройкаСобственныхСерийныхНомеров КАК НастройкаСобственныхСерийныхНомеров
	|ГДЕ
	|	НастройкаСобственныхСерийныхНомеров.Номенклатура В (&Номенклатура)");
	
	Если НЕ ЗначениеЗаполнено(Объект.НоменклатураСканирования) Тогда
		
		ЗапросНоменклатурыСканирования.УстановитьПараметр("Номенклатура", Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
		РезультатНоменклатурыСканирования = ЗапросНоменклатурыСканирования.Выполнить().Выгрузить();
		Если РезультатНоменклатурыСканирования.Количество() = 1 Тогда
			
			ИмяМакета = РезультатНоменклатурыСканирования[0].ИмяМакета;
			
		Иначе
			
			Сообщить("Не указана номенклатуры сканирования");
			Возврат;	
			
		КонецЕсли;	
		
	Иначе
		
		МассивНом = Новый Массив;
		МассивНом.Добавить(Объект.НоменклатураСканирования);
		
		ЗапросНоменклатурыСканирования.УстановитьПараметр("Номенклатура", МассивНом);
		РезультатНоменклатурыСканирования = ЗапросНоменклатурыСканирования.Выполнить().Выгрузить();
		Если РезультатНоменклатурыСканирования.Количество() = 1 Тогда
			
			ИмяМакета = РезультатНоменклатурыСканирования[0].ИмяМакета; 
			
		Иначе	
			
			Сообщить("Не найдена настройка для номенклатуры сканирования: " + Объект.НоменклатураСканирования);
			Возврат;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяМакета) Тогда
		
		Сообщить("Не установлено имя макета!");
		Возврат;	
		
	КонецЕсли;
	
	Если КоличествоГенерируемыхНомеров = 0 Тогда
	
		Сообщить("Укажите количество генерируемых серийных номеров!");
		Возврат;	
	
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Выборка	= РезультатНоменклатурыСканирования[0];	
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.НастройкаСобственныхСерийныхНомеров");
		ЭлементБлокировкиДанных.УстановитьЗначение("Номенклатура", Выборка.Номенклатура);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
						
		ПоследнийНомер = Выборка.ПоследнийНомер;
		
		НоваяЗапись = РегистрыСведений.НастройкаСобственныхСерийныхНомеров.СоздатьМенеджерЗаписи();
		НоваяЗапись.Номенклатура = Выборка.Номенклатура;
		НоваяЗапись.Прочитать();
		НоваяЗапись.ПоследнийНомер = ПоследнийНомер + КоличествоГенерируемыхНомеров;
		НоваяЗапись.Записать();
		
		Для Сч = 1 По КоличествоГенерируемыхНомеров Цикл
			
			ПоследнийНомер = ПоследнийНомер + 1;
			
			ДлинаБезПрефикса = Выборка.ОбщаяДлинаКода - СтрДлина(Выборка.Префикс);
			СформированныйСерийныйНомер = "" + Выборка.Префикс + Формат(ПоследнийНомер, "ЧЦ=" + ДлинаБезПрефикса + "; ЧВН=; ЧГ=0");
			
			ЗаписьПечати = РегистрыСведений.СерийныеНомераНаПечать.СоздатьМенеджерЗаписи();
			
			ЗаписьПечати.Период 		= ТекущаяДата();
			ЗаписьПечати.СерийныйНомер 	= СформированныйСерийныйНомер;
			ЗаписьПечати.Реализация 	= Объект.Ссылка;
			ЗаписьПечати.Количество		= 1;
			ЗаписьПечати.ИмяМакета 		= ИмяМакета;
			
			ЗаписьПечати.Записать();
			
		КонецЦикла; 			
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "" + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение.Сообщить();
		
	КонецПопытки;
		
	Buro1Goz_ОбновитьДанныеПослеНаСервере();
	

КонецПроцедуры // ()


&НаКлиенте
Процедура Buro1Goz_УдалитьНомераПосле(Команда)
	Buro1Goz_УдалитьНомераПослеНаСервере();
КонецПроцедуры


&НаСервере
Процедура Buro1Goz_УдалитьНомераПослеНаСервере()
	
	// Делаем проверку, поступало раньше на склад или нет.
	// Если нет, то нужно добавить запись, чтобы серийник числился на складе
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Сообщить("Предварительно необходимо записать документ!");
		Возврат;	
		
	КонецЕсли;
	
	МассивСерийников = Новый Массив;
	
	Для каждого ВыделеннаяСтрока Из Элементы.СерийныеНомера.Выделенныестроки Цикл
		
		ТекСтрока = СерийныеНомера.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если ЗначениеЗаполнено(ТекСтрока.СерийныйНомер) Тогда
			МассивСерийников.Добавить(ТекСтрока.СерийныйНомер);
		КонецЕсли; 
		
	КонецЦикла;
	
	ДокеументСканированиеНаСклад = Документы.B1_СканированиеНомеровНаСклад.ПолучитьСсылку(Новый УникальныйИдентификатор("8a7a40f2-f463-11ef-a216-bc241145a876")); //Сканирование номеров на склад 000000001 от 26.02.2025 20:03:05
	
	Запрос22 = Новый Запрос("
	|ВЫБРАТЬ
	|	СерийныеНомераНаПечать.Период КАК Период,
	|	СерийныеНомераНаПечать.СерийныйНомер КАК СерийныйНомер,
	|	СерийныеНомераНаПечать.Реализация КАК Реализация,
	|	СерийныеНомераНаПечать.Распечатан КАК Распечатан,
	|	СерийныеНомераНаПечать.Количество КАК Количество,
	|	СерийныеНомераНаПечать.ИмяМакета КАК ИмяМакета,
	|	СерийныеНомераНаПечать.ДобавленныйСерийныйНомер КАК ДобавленныйСерийныйНомер
	|ИЗ
	|	РегистрСведений.СерийныеНомераНаПечать КАК СерийныеНомераНаПечать
	|ГДЕ
	|	СерийныеНомераНаПечать.СерийныйНомер В (&СерийныйНомер)
	|	И СерийныеНомераНаПечать.Реализация ССЫЛКА Документ.B1_СканированиеНомеровНаСклад
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период");
	
	Запрос22.УстановитьПараметр("СерийныйНомер", МассивСерийников);
	
	ТабПроверки = Запрос22.Выполнить().Выгрузить();
	
	Для каждого ВыделеннаяСтрока Из Элементы.СерийныеНомера.Выделенныестроки Цикл
		
		ТекСтрока = СерийныеНомера.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		НаборЗаписей = РегистрыСведений.СерийныеНомераНаПечать.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Реализация.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.СерийныйНомер.Установить(ТекСтрока.СерийныйНомер);

		НСтрока = ТабПроверки.Найти(ТекСтрока.СерийныйНомер, "СерийныйНомер");
		Если НСтрока = Неопределено Тогда
			
			НаборЗаписей.Прочитать();
			
			НаборЗаписей1 = РегистрыСведений.СерийныеНомераНаПечать.СоздатьНаборЗаписей();
			НаборЗаписей1.Отбор.Реализация.Установить(ДокеументСканированиеНаСклад);
			НаборЗаписей1.Отбор.СерийныйНомер.Установить(ТекСтрока.СерийныйНомер);
			НоваяСтрока = НаборЗаписей1.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НаборЗаписей[0]);
			НоваяСтрока.Реализация = ДокеументСканированиеНаСклад;
			НаборЗаписей1.Записать();
			
		КонецЕсли;     
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	Buro1Goz_ОбновитьДанныеПослеНаСервере();
	
	
КонецПроцедуры
